package edu.hzuapps.androidlabs.myContreller;

import android.content.Context;
import android.content.res.Resources;
import android.os.Bundle;

public class MyTools {

    static String text0,text1,text2,text3,text4;

    public static int getResId(String name, Context context){
        Resources r = context.getResources();
        int id = r.getIdentifier(name,"drawable",context.getPackageName());
        return id;
    }

    public static String getText(int id){
        String str = null;
        switch (id){
            case 0 : str = text0;break;
            case 1 : str = text1;break;
            case 2 : str = text2;break;
            case 3 : str = text3;break;
            default:str = text4;
        }
        return str;
    }

    public static void init(){
        text0 = "第一章\n" +
                "[原文]\n" +
                "\n" +
                "道可道也①，非恒道也②。名可名也③，非恒名也。无名④，万物之始也；有名⑤，万物之母也⑥。故恒无欲也⑦，以观其眇⑧；恒有欲也，以观其所徼⑨。两者同出，异名同谓⑩。玄之又玄⑾，众眇之门⑿。\n" +
                "\n" +
                "　\n" +
                "\n" +
                "[译文]\n" +
                "\n" +
                "“道”如果可以用言语来表述，那它就是常“道”(“道”是可以用言语来表述的，它并非一般的“道”)；“名”如果可以用文辞去命名，那它就是常“名”(“名”也是可以说明的，它并非普通的“名”)。“无”可以用来表述天地浑沌未开之际的状况；而“有”，则是宇宙万物产生之本原的命名。因此，要常从“无”中去观察领悟“道”的奥妙；要常从“有”中去观察体会“道”的端倪。无与有这两者，来源相同而名称相异，都可以称之为玄妙、深远。它不是一般的玄妙、深奥，而是玄妙又玄妙、深远又深远，是宇宙天地万物之奥妙的总门(从“有名”的奥妙到达无形的奥妙，“道”是洞悉一切奥妙变化的门径)。\n" +
                "\n" +
                "　\n" +
                "\n" +
                "[注释]\n" +
                "\n" +
                "①第一个“道”是名词，指的是宇宙的本原和实质，引申为原理、原则、真理、规律等。第二个“道”是动词。指解说、表述的意思，犹言“说得出”。\n" +
                "②恒：一般的，普通的。\n" +
                "③第一个“名”是名词，指“道”的形态。第二个“名”是动词，说明的意思。\n" +
                "④无名：指无形。\n" +
                "⑤有名：指有形。\n" +
                "⑥母：母体，根源。\n" +
                "⑦恒：经常。\n" +
                "\n" +
                "⑧眇（miao）：通妙，微妙的意思。\n" +
                "⑨徼（jiao）：边际、边界。引申端倪的意思。\n" +
                "⑩谓：称谓。此为“指称”。\n" +
                "⑾玄：深黑色，玄妙深远的含义。\n" +
                "⑿门：之门,一切奥妙变化的总门径，此用来比喻宇宙万物的唯一原“道”的门径。\n" +
                "\n" +
                "　\n" +
                "\n" +
                "[延伸阅读1]王弼《道德经注》\n" +
                "\n" +
                "道可道，非常道，名可名，非常名。\n" +
                "可道之道，可名之名，指事造形，非其常也，故不可道，不可名也。\n" +
                "\n" +
                "无名，天地之始；有名，万物之母。\n" +
                "凡有皆始於无，故未形无名之时，则为万物之始。及其有形有名之时，则长之育之，亭之毒之，为其母也。言道以无形无名，始成万物，以始以成，而不知其所以玄之又玄也。\n" +
                "\n" +
                "故常无欲，以观其妙；\n" +
                "妙者，微之极也。万物始於微而后成，始於无而后生，故常无欲空虚，可以观其始物之妙。\n" +
                "\n" +
                "常有欲，以观其徼。\n" +
                "徼，归终也。凡有之为利，必以无为用；欲之所本，适道而后济。故常有欲，可以观其终物之徼也。\n" +
                "\n" +
                "此两者，同出而异名。同谓之玄，玄之又玄，众妙之门。\n" +
                "两者，始与母也。同出者，同出於玄也。异名所施，不可同也，在首则谓之始，在终则谓之母。玄者，冥也，默然无有也，始、母之所出也，不可得而名，故不可言。同名曰玄，而言同谓之玄者，取於不可得而谓之然也。谓之然则不可以定乎一玄而已，则是名则失之远矣，故曰玄之又玄也。众妙皆从同而出，故曰众妙之门也。\n" +
                "\n" +
                "　\n" +
                "\n" +
                "[延伸阅读2]苏辙《老子解》\n" +
                "\n" +
                "道可道，非常道。\n" +
                "莫非道也。而可道者不可常，惟不可道，而後可常耳。今夫仁義禮智，此道之可道者也。然而仁不可以為義，而禮不可以為智，可道之不可常如此。惟不可道，然後在仁為仁，在義為義，在禮為禮，在智為智。彼皆不常，而道常不變，不可道之能常如此。\n" +
                "\n" +
                "名可名，非常名。\n" +
                "道不可道，而況可得而名之乎？凡名皆其可道者也。名既立，則圓方曲直之不同，不可常矣。\n" +
                "\n" +
                "無名，天地之始；有名，萬物之母。常無，欲以觀其妙；常有，欲以觀其徼。\n" +
                "自其無名，形而為天地，天地位而名始立矣。自其有名，播而為萬物，萬物育而名不可勝載矣。故無名者道之體，而有名者道之甩也。聖人體道以為天下用，入於衆有而常無，將以觀其妙也。體其至無而常有，將以觀其徼也。若夫行於其徼而不知其妙，則粗而不神矣。留於其妙而不知其繳，則精而不遍矣。\n" +
                "\n" +
                "此兩者，同出而異名，同謂之玄。\n" +
                "以形而言有無，則信兩矣。安知無運而為有，有復而為無，未嘗不一哉。其名雖異，其本則一，知本之一也，則玄矣。凡遠而無所至極者，其色又玄，故老子常以玄寄極也。玄之又玄，衆妙之門。言玄則至矣，然猶有玄之心在焉。玄之又玄則盡矣，不可以有加矣，衆妙之所從出也。";
        text1 = "第二章\n" +
                "[原文]\n" +
                "\n" +
                "天下皆知美之为美，恶已①；皆知善，斯不善矣②。有无之相生也③，难易之相成也，长短之相刑也④，高下之相盈也⑤，音声之相和也⑥，先后之相随，恒也。是以圣人居无为之事⑦，行不言之教，万物作而弗始也⑧，为而弗志也⑨，成功而弗居也。夫唯弗居，是以弗去。\n" +
                "\n" +
                "　\n" +
                "\n" +
                "[译文]\n" +
                "\n" +
                "天下人都知道美之所以为美，那是由于有丑陋的存在。都知道善之所以为善，那是因为有恶的存在。所以有和无互相转化，难和易互相形成，长和短互相显现，高和下互相充实，音与声互相谐和，前和后互相接随——这是永恒的。因此圣人用无为的观点对待世事，用不言的方式施行教化：听任万物自然兴起而不为其创始，有所施为，但不加自己的倾向，功成业就而不自居。正由于不居功，就无所谓失去。\n" +
                "\n" +
                "　\n" +
                "\n" +
                "[注释]\n" +
                "\n" +
                "①恶已：恶、丑。已，通“矣”。\n" +
                "\n" +
                "②斯：这。\n" +
                "\n" +
                "③相：互相。\n" +
                "\n" +
                "④刑：通“形”，此指比较、对照中显现出来的意思。\n" +
                "\n" +
                "⑤盈：充实、补充、依存。\n" +
                "\n" +
                "⑥音声：汉代郑玄为《礼记·乐记》作注时说，合奏出的乐音叫做“音”，单一发出的音响叫做“声”。\n" +
                "\n" +
                "⑦圣人居无为之事：圣人，古时人所推崇的最高层次的典范人物。居，担当、担任。无为，顺应自然，不加干涉、不必管束，任凭人们去干事。\n" +
                "\n" +
                "⑧作：兴起、发生、创造。\n" +
                "\n" +
                "⑨弗志：弗，不。志，指个人的志向、意志、倾向。\n" +
                "\n" +
                "　\n" +
                "\n" +
                "[延伸阅读1]王弼《道德经注》\n" +
                "\n" +
                "天下皆知美之为美，斯恶已；皆知善之为善，斯不善已。故有无相生，难易相成，长短相较，高下相倾，音声相和，前后相随。\n" +
                "美者，人心之所进乐也。亚心者，人心之所恶疾也。美恶，犹喜怒也。善不善，犹是非也。喜怒同根，是非同门，故不可得徧举也。此六者，皆陈自然不可徧举之明数也。\n" +
                "\n" +
                "是以圣人处无为之事，\n" +
                "自然已足，为则败也。\n" +
                "\n" +
                "行不言之教。万物作焉而不辞，生而不有，为而不恃，\n" +
                "智慧自备，为则伪也。\n" +
                "\n" +
                "功成而弗居。\n" +
                "因物而用，功自彼成，故不居也。\n" +
                "\n" +
                "夫唯弗居，是以不去。\n" +
                "使功在己，则功不可久也。\n" +
                "\n" +
                "　\n" +
                "\n" +
                "[延伸阅读2]苏辙《老子解》\n" +
                "\n" +
                "天下皆知美之為美，斯惡矣；皆知善之為善，斯不善矣。故有無之相生，難易之相成，長短之相形，高下之相傾，聲音之相和，前後之相隨。\n" +
                "天下以形名言美惡，其所謂美且善者，豈信美且善哉。彼不知有無、難易、長短、高下、聲音、前後之相生相奪，皆非其正也。方且自以為長，而有長於我者臨之，斯則短矣。方且自以為前，而有前於我者先之，斯則後矣。苟從其所美而信之，則失之遠矣。\n" +
                "\n" +
                "是以聖人處無為之事，行不言之教。\n" +
                "當事而為，無為之之心；當教而言，無言之之意。夫是以出於長短之度，離於先後之數，非美非惡，非善非不善，而天下何足以知之。\n" +
                "\n" +
                "萬物作而不辭，生而不有，為而不恃，功成不居。\n" +
                "萬物為我作，而我無所辭。我生之為之，而未嘗有，未嘗恃。至於成功，亦未嘗以自居也。此則無為不言之報，其為美且善也，豈復有惡與不善繼之哉。 　\n" +
                "\n" +
                "夫惟不居，是以不去。\n" +
                "聖人居於貧賤而無貧賤之憂，居於富貴而無富貴之累，此所謂不居也。我且不居，彼尚何從去哉，此則居之至也。";
        text2 = "第三章\n" +
                "[原文]\n" +
                "\n" +
                "不上贤①，使民不争；不贵难得之货②，使民不为盗③；不见可欲④，使民不乱。是以圣人之治也，虚其心⑤，实其腹，弱其志⑥，强其骨，恒使民无知、无欲也。使夫知不敢⑦、弗为而已⑧，则无不治矣⑨。\n" +
                "[译文]\n" +
                "\n" +
                "不推崇有才德的人，导使老百姓不互相争夺；不珍爱难得的财物，导使老百姓不去偷窃；不显耀足以引起贪心的事物，导使民心不被迷乱。因此，圣人的治理原则是：排空百姓的心机，填饱百姓的肚腹，减弱百姓的竞争意图，增强百姓的筋骨体魄，经常使老百姓没有智巧，没有欲望。致使那些有才智的人也不敢妄为造事。圣人按照“无为”的原则去做，办事顺应自然，那么，天才就不会不太平了。\n" +
                "[注释]\n" +
                "\n" +
                "①上贤：上，同“尚”，即崇尚，尊崇。贤：有德行、有才能的人。\n" +
                "\n" +
                "②贵：重视，珍贵。货：财物。\n" +
                "\n" +
                "③盗：窃取财物。\n" +
                "\n" +
                "④见（xian）：通“现”，出现，显露。此是显示，炫耀的意思。\n" +
                "\n" +
                "⑤虚其心：虚，空虚。心：古人以为心主思维，此指思想，头脑。虚其心，使他们心里空虚，无思无欲。\n" +
                "\n" +
                "⑥弱其志：使他们减弱志气。削弱他们竞争的意图。\n" +
                "\n" +
                "⑦敢：进取。\n" +
                "\n" +
                "⑧弗为：同“无为”。\n" +
                "\n" +
                "⑨治：治理，此意是治理得天下太平。\n" +
                "\n" +
                "　\n" +
                "\n" +
                "[延伸阅读1]王弼《道德经注》\n" +
                "\n" +
                "不尚贤，使民不争；不贵难得之货，使民不为盗；不见可欲，使心不乱。\n" +
                "贤，犹能也。尚者，嘉之名也。贵者，隆之称也。唯能是任，尚也曷为？唯用是施，贵之何为？尚贤显名，荣过其任，为而常校能相射。贵货过用，贪者竞趣，穿窬探箧，没命而盗。故可欲不见，则心无所乱也。\n" +
                "\n" +
                "是以圣人之治，虚其心，实其腹，\n" +
                "心怀智而腹怀食，虚有智而实无知也。\n" +
                "\n" +
                "弱其志，强其骨。\n" +
                "骨无知以干，志生事以乱。\n" +
                "\n" +
                "常使民无知无欲，\n" +
                "守其真也。\n" +
                "\n" +
                "使夫知者不敢为也。\n" +
                "知者谓知为也。\n" +
                "\n" +
                "为无为则无不治。\n" +
                "\n" +
                "　\n" +
                "\n" +
                "[延伸阅读2]苏辙《老子解》\n" +
                "\n" +
                "不尚賢，使民不爭；不貴難得之貨，使民不為盜；不見可欲，使心不亂。是以聖人之治也，虛其心，實其腹，弱其志，強其骨。\n" +
                "尚賢，則民恥於不若而至於爭。貴難得之貨，則民病於無有而至於盜。見可欲，則民患於不得而至於亂。雖然天下知三者之為息，而欲舉而廢之，則惑矣。聖人不然，未嘗不用賢也，獨不尚賢耳。未嘗棄難得之貨也，獨不貴之耳。未嘗去可欲也，獨不見之耳。夫是以賢者用而民不爭，難得之貨可欲之事畢效於前，而盜賊禍亂不起，是不亦虛其心而不害腹之實，弱其志而不害骨之強也哉。今將舉賢而尚之，寶貨而貴之，街可欲以示之，則是心與腹皆實也。若舉而廢之，則是志與骨皆弱也。心與腹皆實，則民爭；志與骨皆弱，則無以立矣。\n" +
                "\n" +
                "常使民無知無欲，使夫知者不敢為也。\n" +
                "不以三者街之，則民不知所慕，澹乎其無欲，雖有智者，無所用巧矣。 　\n" +
                "\n" +
                "為無為，則無不治矣。\n" +
                "即用三者之自然而不尚、不貴、不見，所謂為無為也。";
        text3 = "第四章\n" +
                "[原文]\n" +
                "\n" +
                "道冲①，而用之有弗盈也②。渊呵③！似万物之宗④。锉其兑⑤，解其纷⑥，和其光⑦，同其尘⑧。湛呵⑨！似或存⑩。吾不知其谁之子，象帝之先⑾。\n" +
                "\n" +
                "　\n" +
                "\n" +
                "[译文]\n" +
                "\n" +
                "大“道”空虚开形，但它的作用又是无穷无尽。深远啊！它好象万物的祖宗。消磨它的锋锐，消除它的纷扰，调和它的光辉，混同于尘垢。隐没不见啊，又好象实际存在。我不知道它是谁的后代，似乎是天帝的祖先。\n" +
                "\n" +
                "　\n" +
                "\n" +
                "[注释]\n" +
                "\n" +
                "①冲：通盅（chong)，器物虚空，比喻空虚。\n" +
                "\n" +
                "②有弗盈：有，通又。盈：满，引申为尽。\n" +
                "\n" +
                "③渊：深远。呵（a）：语助词，表示停顿。\n" +
                "\n" +
                "④宗：祖宗，祖先。\n" +
                "\n" +
                "⑤锉其兑：锉（cuo）：消磨，折去。兑（rui）：通锐，锐利、锋利。锉其锐：消磨掉它的锐气。\n" +
                "\n" +
                "⑥解其纷：消解掉它的纠纷。\n" +
                "\n" +
                "⑦和其光：调和隐蔽它的光芒。\n" +
                "\n" +
                "⑧同其尘：把自己混同于尘俗。以上四个“其”字，都是说的道本身的属性。\n" +
                "\n" +
                "⑨湛（zhan）：沉没，引申为隐约的意思。段玉裁在《说文解字注》中说，古书中“浮沉”的“沉”多写作“湛”。“湛”、“沉”古代读音相同。这里用来形容“道”隐没于冥暗之中，不见形迹。\n" +
                "\n" +
                "⑩似或存：似乎存在。连同上文“湛呵”，形容“道”若无若存。参见第十四章“无状之状，无物之象，是谓惚恍”等句，理解其意。\n" +
                "\n" +
                "⑾象：似。\n" +
                "\n" +
                "　\n" +
                "\n" +
                "[延伸阅读1]王弼《道德经注》\n" +
                "\n" +
                "道冲而用之，或不盈，渊兮似万物之宗。挫其锐，解其纷，和其光，同其尘，湛兮似或存。吾不知谁之子，象帝之先。\n" +
                "夫执一家之量者，不能全家；执一国之量者，不能成国；穷力举重，不能为用。故人虽知万物治也，治而不以二仪之道，则不能赡也。地虽形魄，不法于天，则不能全其宁；天虽精象，不法于道，则不能保其精。冲而用之，用乃不能穷；满以造实，实来则溢。故冲而用之，又复不盈，其为无穷亦已极矣。形虽大，不能累其体；事虽殷，不能充其量。万物舍此而求主，主其安在乎？不亦渊兮似万物之宗乎？锐挫而无损，纷解而不劳，和光而不污，其体同尘而不渝其真，不亦湛兮似或存乎？地守其形，德不能过其载；天怀其象，德不能过其覆。天地莫能及之，不亦似帝之先乎？帝，天帝也。\n" +
                "\n" +
                "　\n" +
                "\n" +
                "[延伸阅读2]苏辙《老子解》\n" +
                "\n" +
                "道沖而用之，或似不盈，淵兮似萬物之宗。\n" +
                "夫道沖然至無耳，然以之適衆有，雖天地之大，山河之廣，無所不遍，以其無形，故似不盈者。淵兮深眇，吾知其為萬物宗也，而不敢正言之，故曰似萬物之宗。\n" +
                "\n" +
                "挫其銳，解其紛，和其光，同其塵，湛兮似或存。\n" +
                "人莫不有道也，而聖人能全之。挫其銳，恐其流於妄也。解其紛，恐其與物構也。不流於妄，不構於物，外患已去，而光生焉，又從而和之，恐其與物異也。光至潔也，塵至維也，雖塵無所不同，恐其棄萬物也。如是而後全，則湛然其常存矣，雖存而人莫之識，故曰似或存耳。\n" +
                "\n" +
                "吾不知誰之子，象帝之先。\n" +
                "道雖常存，終莫得而名之，然亦不可謂無也，故曰此豈帝之先耶。帝先矣而又先於帝，則莫或先之者矣。";
        text4 = "第五章\n" +
                "[原文]\n" +
                "\n" +
                "天地不仁，以万物为刍狗①；圣人不仁，以百姓为刍狗。天地之间，其犹橐龠乎②？虚而不屈③，动而俞出④。多闻数穷⑤，不若守于中⑥。\n" +
                "[译文]\n" +
                "\n" +
                "天地是无所谓仁慈的，它没有仁爱，对待万事万物就像对待刍狗一样，任凭万物自生自灭。圣人也是没有仁受的，也同样像刍狗那样对待百姓，任凭人们自作自息。天地之间，岂不像个风箱一样吗？它空虚而不枯竭，越鼓动风就越多，生生不息。政令繁多反而更加使人困惑，更行不通，不如保持虚静。\n" +
                "[注释]\n" +
                "\n" +
                "①刍（chu）狗：用草扎成的狗。古代专用于祭祀之中，祭祀完毕，就把它扔掉或烧掉。比喻轻贱无用的东西。在本文中比喻：天地对万物，圣人对百姓都因不经意、不留心而任其自长自消，自生自灭。正如元代吴澄据说　：“刍狗，缚草为狗之形，祷雨所用也。既祷则弃之，无复有顾惜之意。天地无心于爱物，而任其自生自成；圣人无心于爱民，而任其自作自息，故以刍狗为喻。”\n" +
                "\n" +
                "②犹橐龠（tuoyue）：犹，比喻词，“如同”、“好象”的意思。橐龠：古代冶炼时为炉火鼓风用的助燃器具——袋囊和送风管，是古代的风箱。\n" +
                "\n" +
                "③屈（gu）：竭尽，穷尽。\n" +
                "\n" +
                "④俞：通愈，更加的意思。\n" +
                "\n" +
                "⑤多闻数穷：闻，见闻，知识。老子认为，见多识广，有了智慧，反而政令烦苛，破坏了天道。数：通“速”，是加快的意思。穷：困穷，穷尽到头，无路可行。\n" +
                "\n" +
                "⑥守中：中，通冲，指内心的虚静。守中：守住虚静。\n" +
                "\n" +
                "　\n" +
                "\n" +
                "[延伸阅读1]王弼《道德经注》\n" +
                "\n" +
                "天地不仁，以万物为刍狗；\n" +
                "天地任自然，无为无造，万物自相治理，故不仁也。仁者必造立施化，有恩有为。造立施化，则物失其真；有恩有为。则物不具存；物不具存，则不足以备载矣。地不为兽生刍而兽食刍，不为人生狗而人食狗，无为於万物，而万物各适其所用，则莫不赡矣。若慧由己树，未足任也。\n" +
                "\n" +
                "圣人不仁，以百姓为刍狗。\n" +
                "圣人与天地合其德，以百姓比刍狗也。\n" +
                "\n" +
                "天地之间，其犹橐钥乎？虚而不屈，动而愈出。\n" +
                "橐，排橐也。钥，乐钥也。豪钥之中空洞，无情无为，故虚而不得穷屈，动而不可竭尽也。天地之中，荡然任自然，故不可得而穷，犹若橐钥也。\n" +
                "\n" +
                "多言数穷，不如守中。\n" +
                "愈为之，则愈失之矣。物树其恶，事错其言。不济、不言、不理，必穷之数也。橐钥而守数中，则无穷尽；弃己任物，则莫不理。若橐钥有意於为声也，则不足以共吹者之求也。\n" +
                "\n" +
                "　\n" +
                "\n" +
                "[延伸阅读2]苏辙《老子解》\n" +
                "\n" +
                "天地不仁，以萬物為芻狗；聖人不仁，以百姓為芻狗。\n" +
                "天地無私，而聽萬物之自然，故萬物自生自死，死非吾虐之，生非吾仁之也。譬如結芻以為狗，設之於祭祀，盡飾以奉之，夫豈愛之，時適然也。既事而棄之，行者踐之，夫豈惡之，亦適然也。聖人之於民亦然，特無以害之，則民全其性，死生得喪，吾無與焉。雖未嘗仁之，而仁亦大矣。\n" +
                "\n" +
                "天地之間，其獨橐籥乎？虛而不屈，動而愈出。\n" +
                "排之有橐與籥也，方其一動，氣之所及，無不靡也，不知者以為機巧極矣。然橐籥則何為哉？蓋亦虛而不屈，是以動而愈出耳。天地之問，其所以生殺萬物，雕刻衆形者，亦若是而已矣。\n" +
                "\n" +
                "多言數窮，不如守中。\n" +
                "見其動而愈出，不知其為虛中之報也，故告之以多言數窮，不如守中之不窮也。";
    }
}
